app/controllers/todolists_controller.rb

  def create
    list = List.new(list_params)
    list.save
---
INSERT INTO "lists" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "画像の投稿ができます"], ["body", "なんでも投稿OK"], ["created_at", "2020-11-04 12:43:04.493377"], ["updated_at", "2020-11-04 12:43:04.493377"]]

  def edit
    @list = List.find(params[:id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    list = List.find(params[:id])
    list.update(list_params)
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "lists" SET "body" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["body", "本文です！\r\n追記：編集しました！"], ["updated_at", "2020-11-05 09:57:10.555128"], ["id", 1]]

  def destroy
    list = List.find(params[:id])
    list.destroy
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 1]]